<?php

namespace App\Exports;
use App\Models\Mentor;
use Maatwebsite\Excel\Concerns\FromCollection;
use Maatwebsite\Excel\Concerns\WithHeadings;
class mentorExport implements FromCollection, WithHeadings
{
    /**
    * @return \Illuminate\Support\Collection
    */
    public function collection()
    {
        
        $mentor = Mentor::orderBy('created_at','desc')->get();
        $mentor->makeHidden(['id', 'user_id', 'user_type', 'created_at','updated_at']);
       
        return $mentor;
    }
    public function headings(): array
    {
        return [
            'पूरा नाम',
            'इमेल ठेगाना',
            'प्रदेश',
            'जिल्ला',
            
            'पालिका',
            'फोन नम्बर',
            'लिङ्ग',
            'हाल कार्यरत वा आवद्ध रहेको संस्था',
            'हालको पद',
            'क्षेत्रगत विज्ञता/ तपाइंको विशेषज्ञताको क्षेत्रको अनुभव',
            'तपाइंको अनुभवको अवधि कति हो?',
            'तपाइंको अन्य पेशागत आवद्धता के-के छन्, अथवा अन्य संलग्नता उल्लेख गर्नुहोस',
            'तपाईं कस्तो प्रकारको प्रशिक्षक हुनलाई आवेदन भर्दै हुनुहुन्छ?',
            'यदि प्राज्ञिक व्यक्ति क्षेत्रगत विशेषज्ञ हो उक्त विषय, क्षेत्र र पक्षको उल्लेख गर्नुहोस',
            'तपाइंको भविष्यका प्रशिक्षार्थीलाई महिनामा कति घण्टा (अधिकतम) दिन सक्नुहुन्छ? ',
            'प्रशिक्षण कार्यक्रमबाट तपाईंका अपेक्षाहरु के छन्?',
            'यसभन्दा अघि पनि प्रशिक्षकको रूपमा काम गर्नुभएको छ?',
            'यदि छ भने कस्तो प्रशिक्षण कार्यमा सहभागी हुनुहुन्थ्यो? उल्लेख गर्नुहोस',
            'तपाईंको व्यक्तिगत विवरण वा तपाइंको अनुभव तथा योग्यता समावेश भएको संक्षिप्त विवरण संलग्न गर्नुहोस',
            'तपाईंको पासपोर्ट आकारको तस्वीर संलग्न गर्नुहोस (गगल्स, सन्ग्लास अथवा क्याप लगाएको तस्वीर प्रयोग नगर्नुहोला)',
           
        ];
    }
}
